OpenFOAM_Maincode/tutorials/incompressibleDenseParticleFluid/cyclone/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (-0.55 -0.55 -1  )
    ( 0.55 -0.55 -1  )
    ( 0.55  0.55 -1  )
    (-0.55  0.55 -1  )

    (-0.55 -0.55  1.1)
    ( 0.55 -0.55  1.1)
    ( 0.55  0.55  1.1)
    (-0.55  0.55  1.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (33 33 63) simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
